InformationRegisters/ra_OpisaniePredmetaKontrolya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ra_OpisaniePredmetaKontrolya</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>OboznachenieINaimenovaniePredmeta</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ProektnayaDokumentaciya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_Dokumentaciya</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReviziyaProektnojDokumentacii</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RabochayaDokumentaciya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_Dokumentaciya</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReviziyaRabochejDokumentacii</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NaimenovanieTekhnologicheskojSistemy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_TekhnologicheskieSistemy</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NaimenovanieOborudovaniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_MTRiO</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>KlassifikatorMTRiO</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_KlassifikatorMTR</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Oborudovanie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_Oborudovanie</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ZavodskojNomerOborudovaniya</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DataIzgotovleniyaProdukcii</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ChertezhnyjNomer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NomerPlanaKachestva</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Sertifikat</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OrganizatsiyaVydavshayaSertifikat</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>KlassBezopasnosti</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_KlassyBezopasnosti</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NomerPartii</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>KolichestvoPredyavleno</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>KolichestvoZabrakovano</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>KriteriiKontrolya</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ZayavkaNaKontrolnuyuOperaciyu</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ra_ZayavkaNaKontrolnuyuOperaciyu</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ra_OpisaniePredmetaKontrolya/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если Количество() = 1 Тогда
			
			Если ДанныеЗаполнения.Свойство("ZayavkaNaKontrolnuyuOperaciyu") Тогда
				Отбор.ZayavkaNaKontrolnuyuOperaciyu.Установить(ДанныеЗаполнения.ZayavkaNaKontrolnuyuOperaciyu);
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("ID") Тогда
				Отбор.ID.Установить(ДанныеЗаполнения.ID);
			КонецЕсли;
						
			Если ДанныеЗаполнения.Свойство("ZayavkaNaKontrolnuyuOperaciyu") И
					ДанныеЗаполнения.Свойство("ID") Тогда
				Прочитать();
			Иначе
				ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ID) Тогда
			СтрокаНабора.ID = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РегистрыСведений.ra_OpisaniePredmetaKontrolya.АктуализироватьМассивОбязательныхРеквизитов(ПроверяемыеРеквизиты, ЭтотОбъект[0]);
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Отбор.ZayavkaNaKontrolnuyuOperaciyu.Значение) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана Заявка на контрольную операцию.';
					|en = 'Application for control operation is not specified.'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отбор.ID.Значение) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан уникальный идентификатор строки.';
					|en = 'Unique identificator is not specified.'");
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.KlassifikatorMTRiO) И ЗначениеЗаполнено(Запись.NaimenovanieOborudovaniya) Тогда
			Запись.KlassifikatorMTRiO = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.NaimenovanieOborudovaniya, "KlassifikatorMTR");
		КонецЕсли;
	КонецЦикла;
		
	ПроверитьВозможностьУдаления(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВозможностьУдаления(НаборДанных, Отказ)
	
	Если НЕ НаборДанных.ДополнительныеСвойства.Свойство("УдалениеЗаписей") Тогда
		Возврат;
	КонецЕсли;
					
КонецПроцедуры

#КонецОбласти
